# %d 整数点位符
# %f 浮点数点位符
# %.f 指定精度的浮点数点位符
# %s 字符串占位数
# %% 输出百分号%

lap = 3
print("我跑完了第%d圈" % lap)

print("%d" % 3.14)
print("%d" % 3.99)

print("圆周率：%f" % 3.1415926)
print("账户余额：%.2f" % 99.99)
print("不足两位会补零：%.2f" % 3.1)
print("整数自动转为浮点数，并截取到小数点后两位：%.2f" % 3)

print("%s" % 100)
print("%s" % 3.14)
print("%s" % 'python')

# report = str(2019) + "年" + "腾讯" + "公司营收增长了百分之" + str(20.28)
report = "%d年%s公司营收增长了%.2f%%" % (2019, "腾讯", 20.28)
print(report)


# 12亿3000万
# 1,234,567,890
print('{:,}'.format(1234567890))

report = "{0}年{1}公司营收增长了{2}%".format(2019, "腾讯", 20.28)
print(report)

s = "{0}的GDP为{1:,}...虽然它的GDP只有{1:,}美元，但它的人均GDP高达18万美元".format("摩纳哥", 871000000000)
print(s)